<?php
return [
    'PetInformation' => 'ข้อมูลสัตว์เลี้ยง',
    'PetName' => 'ชื่อสัตว์เลี้ยง',
    'Species' => 'ประเภทสัตว์เลี้ยง',
    'Breed' => 'สายพันธุ์',
    'Gender' => 'เพศ',
    'Birthdate' => 'วันเกิด',
    'ColorMarkings' => 'สี/ลักษณะเฉพาะ',
    'HomeLocation' => 'สถานที่พักอาศัย',
    'Next' => 'ถัดไป',
    'PetNamePlac' => 'กรุณากรอกชื่อสัตว์เลี้ยง',
    'SpeciesPlac' => 'กรุณากรอกประเภทสัตว์เลี้ยง',
    'BreedPlac' => 'กรุณากรอกสายพันธุ์สัตว์เลี้ยง',
    'GenderPlac' => 'กรุณากรอกเพศ',
    'ColorMarkingsPlac' => 'กรุณากรอกสีหรือลักษณะเฉพาะ',
    'cat' => 'แมว',
    'dog' => 'สุนัข',
    'other' => 'อื่นๆ',
    'PleaseSelect' => 'โปรดเลือก',
    'male' => 'เพศเมีย',
    'female' => 'เพศผู้',
    'Back' => 'กลับ',
    'emailOwner' => 'อีเมล',
    'passwordOwner' => 'รหัสผ่าน',
    'FullName' => 'ชื่อ-นามสกุล',
    'Nickname' => 'ชื่อเล่น',
    'ContactNumber' => 'เบอร์โทรศัพท์',
    'address' => 'ที่อยู่',
    'HaveAccount' => 'ถ้าคุณมีบัญชีอยู่แล้ว โปรดเช็คตรงนี้',
    'ownerInformation' => 'ข้อมูลเจ้าของ',
    'ownerAccount' => 'บัญชีเจ้าของ',
    'emailPlac' => 'โปรดกรอกบัญชีอีเมลของคุณ',
    'passwordPlac' => 'โปรดกรอกรหัสผ่านของคุณ',
    'namePlac' => 'โปรดกรอกชื่อเต็มของคุณ',
    'nickPlac' => 'โปรดกรอกเล่นของคุณ',
    'phonePlac' => 'โปรดกรอกเบอร์ติดต่อของคุณ',
    'numberPlac' => 'โปรดกรอกที่อยู่ของคุณ',

    'image.required' => 'โปรดอัปโหลดรูปภาพสัตว์เลี้ยงของคุณเพื่อลงทะเบียน',
    'name.required' => 'โปรดกรอกชื่อสัตว์เลี้ยงของคุณเพื่อลงทะเบียน',
    'species.required' => 'โปรดเลือกสายพันธุ์สัตว์เลี้ยงของคุณเพื่อลงทะเบียน',
    'breed.required' => 'โปรดกรอกพันธุ์สัตว์เลี้ยงของคุณเพื่อลงทะเบียน',
    'gender.required' => 'โปรดเลือกเพศของสัตว์เลี้ยงของคุณเพื่อลงทะเบียน',
    'birthday.required' => 'โปรดเลือกวันเกิดของสัตว์เลี้ยงของคุณเพื่อลงทะเบียน',
    'color.required' => 'โปรดกรอกสีหรือลักษณะเฉพาะของสัตว์เลี้ยงของคุณเพื่อลงทะเบียน',
    'other.required' => 'โปรดระบุสายพันธุ์สัตว์เลี้ยงของคุณ',

    'okay' => 'ตกลง',
    'error' => 'พบข้อผิดพลาด!',

    'owner_image.required' => 'กรุณาอัปโหลดรูปภาพเจ้าของ',
    'user_email.required' => 'กรุณากรอกอีเมล',
    'user_email.email' => 'รูปแบบอีเมลไม่ถูกต้อง',
    'email.unique' => 'อีเมลนี้ถูกใช้ไปแล้ว กรุณาลองใช้อีเมลอื่น',
    'user_password.required' => 'กรุณากรอกรหัสผ่าน',

    'password.min' => 'รหัสผ่านต้องมีอย่างน้อย 8 ตัวอักษร',
    'password.latter' => 'รหัสผ่านต้องมีทั้งตัวอักษรและตัวเลข',

    'user_fullname.required' => 'กรุณากรอกชื่อเต็ม',
    'user_fullname.string' => 'ชื่อเต็มต้องเป็นตัวอักษร',
    'user_nickname.required' => 'กรุณากรอกชื่อเล่น',
    'user_nickname.string' => 'ชื่อเล่นต้องเป็นตัวอักษร',
    'user_phoneNumber.required' => 'กรุณากรอกเบอร์โทรศัพท์',
    'user_phoneNumber.regex' => 'รูปแบบเบอร์โทรศัพท์ไม่ถูกต้อง',
    'user_phoneNumber.min' => 'เบอร์โทรศัพท์ต้องมีอย่างน้อย 10 หลัก',
    'user_phoneNumber.max' => 'เบอร์โทรศัพท์ต้องไม่เกิน 10 หลัก',
    'user_address.required' => 'กรุณากรอกที่อยู่',

    'Spayed' => 'สถานะการทำหมัน',
    'Health' => 'สุขภาพหรืออาการแพ้',
    'HealthPlac' => 'สุขภาพ...',

    'NeuteredTrue' => 'ทำหมันแล้ว',
    'NeuteredFalse' => 'ยังไม่ได้ทำหมัน',
    'spayed_status' => 'โปรดเลือกสถนะการทำหมัน',
    'HealthInformation' => 'ข้อมูลสุขภาพ',
    'AdditionalNotes' => 'ข้อมูลเพิ่มเติม',
    'CareInstructions' => 'แนวทางการดูแล',
    'EmergencyContact' => 'เบอร์ติดต่อฉุกเฉิน',
    'emergency_contact' => 'โปรดกรอกเบอร์ฉุกเฉิน',
    'care_instructions' => 'โปรดกรอกข้อมูลการดูแล',

    'error_occurred' => 'เกิดข้อผิดพลาดบางอย่างโปรดลองใหม่ภายหลัง',

    'are_you_sure' => 'คุณแน่ใจหรือไม่?',
    'want_to_save' => 'คุณต้องการบันทึกข้อมูลนี้หรือไม่?',

    'cancel' => 'ยกเลิก',

    'congratulations' => 'ขอแสดงความยินดี!',
    'registration_success' => 'คุณได้ลงทะเบียนสัตว์เลี้ยงของคุณกับเราเรียบร้อยแล้ว คุณสามารถเข้าไปดูข้อมูลของสัตว์เลี้ยงของคุณในโปรไฟล์ได้ผ่านลิงก์นี้',
    'go_login' => 'เข้าสู่ระบบ',

    'qr_code_register' => 'กรุณาสแกนเพื่อลงทะเบียนผ่าน QR Code หรือติดต่อฝ่ายสนับสนุนเพื่อแก้ปัญหา',

    'password_incorrect' => 'รหัสผ่านไม่ถูกต้อง กรุณากรอกรหัสผ่านให้ถูกต้อง',
    'email_not_found' => 'ไม่พบ email นี้ในฐานข้อมูลของเรา',

    'code_not_found_or_registered' => 'โค้ดนี้ไม่มีอยู่หรือถูกลงทะเบียนไปแล้ว กรุณาตรวจสอบหรือติดต่อฝ่ายสนับสนุน',
    'password_confirmation' => 'ยืนยันรหัสผ่าน',

    'confirm_password.required' => 'โปรดยืนยันรหัสผ่าน',
    'confirm_password.same' => 'รหัสผ่านไม่ตรงกันกรุณาตรวจสอบรหัสผ่านของคุณ',

    'Submit' => 'บันทึก',

    "owner_full_name" => "ชื่อเต็ม",
    "nickname" => "ชื่อเล่น",
    "contact_number" => "หมายเลขติดต่อ",
    "email_address" => "ที่อยู่อีเมล",

    "Age" => 'อายุ',
    'home_location' => 'ตำแหน่งที่อยู่',

    'sign_in_account' => 'เข้าสู่ระบบบัญชี',
    'login_prompt' => 'กรุณากรอกอีเมลและรหัสผ่านเพื่อเข้าสู่ระบบ',
    'enter_email' => 'กรอกที่อยู่อีเมลของคุณ',
    'password' => 'รหัสผ่าน',
    'enter_password' => 'กรอกรหัสผ่านของคุณ',
    'remember_me' => 'จดจำฉัน',
    'forgot_password' => 'ลืมรหัสผ่าน',
    'login' => 'เข้าสู่ระบบ',

    'enter_email_receive' => 'กรุณากรอกอีเมลของคุณเพื่อรับลิงก์รีเซ็ตรหัสผ่าน',
    'submit' => 'ส่ง',

    'Save' => 'บันทึก',
    'change_password' => 'เปลี่ยนรหัสผ่าน',
    'enter_passwords' => 'กรุณากรอกรหัสผ่านปัจจุบันและรหัสผ่านใหม่ของคุณเพื่ออัพเดทบัญชีของคุณ',
    'new_password' => 'รหัสผ่านใหม่',
    'confirm_password' => 'ยืนยันรหัสผ่าน',

    'link_or_token_expired' => 'ลิงก์หรือโทเค็นหมดอายุ',
    'link_or_token_expired_message' => 'ลิงก์หรือโทเค็นที่คุณใช้อยู่หมดอายุแล้ว กรุณาส่งคำขอใหม่เพื่อรับลิงก์ใหม่',

    'email_sent_success' => 'ส่งอีเมลสำเร็จ!',
    'email_sent_message' => 'อีเมลของคุณถูกส่งสำเร็จแล้ว กรุณาตรวจสอบอีเมลของคุณเพื่อรับลิงก์.',
    'password_change_success' => 'เปลี่ยนรหัสผ่านสำเร็จ!',
    'password_change_message' => 'รหัสผ่านของคุณถูกเปลี่ยนสำเร็จแล้ว ตอนนี้คุณสามารถเข้าสู่ระบบด้วยรหัสผ่านใหม่ของคุณ.',

    'not_found' => '404 ไม่พบหน้า',
    'not_found_message' => 'ไม่พบหน้าที่คุณเรียกหาดรุณากรอก url ให้ถูกต้องหรือติดต่อฝ่าย Support',
    'failed' => 'การเข้าสู่ระบบล้มเหลวกรุณาตรวจสอบ email และ password ของคุณ',

    'please_enter_password' => 'โปรดกรอกรหัสผ่านของคุณ',
    'please_enter_email' => 'โปรดกรอก email ของคุณ',
    'invalid_email_format' => 'รูปแบบ email ของคุณไม่ถูกต้อง',
    "choose_your_pet" => "เลือกสัตว์เลี้ยงของคุณ",
    "pets_list_description" => "นี่คือรายการสัตว์เลี้ยงที่คุณรัก เลือกโปรไฟล์เพื่อดูหรืออัปเดตข้อมูลให้ถูกต้อง"


];
